Revit 2026 API

# GenericGenericReflectivityAt90deg Property

---

The property labeled "Reflectivity/Oblique" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericReflectivityAt90deg { get; }
```
```vb
Public Shared ReadOnly Property GenericReflectivityAt90deg As String
	Get
```
```cpp
public:
static property String^ GenericReflectivityAt90deg {
	String^ get ();
}
```
```fsharp
static member GenericReflectivityAt90deg : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace